PinkiePie1/ch32vfunplayground/wildCat_interleaved/main.c
#include "ch32fun.h"
#include <stdbool.h>
#include <stdio.h>

/*参数定义*/

/*全局变量*/
uint16_t adcval = 0;
uint32_t vccval = 0;
uint32_t adcinterrupttimes = 0;

/*
 *  总的思路是第一个timer一个通道直出，另外两个通道控制dma来控制?第二个
 *  最后一个通道则是输出TRGO让第二个timer在正确的时候启动，第二个timer
 *  直出就行。
 *  单次模式也有说法，即用一个定时器触发另一个定时器的单次模式。但不论
 *  如何都很难绕开DMA。
 */



void ADC1_IRQHandler(void)
	__attribute__((interrupt))
	__attribute__((section(".srodata")));


/**
 * @brief 初始化GPIO
 *
 * PA1和PA2还有PD7三个脚分别为三个flyback的控制脚
 * PA2由DMA控制，就用T1CH4和T1CH3吧
 * PA1由T1CH2。
 * PD7由timer2CH4直接控制
 *
 * 注意PD7也是reset脚，所以要在下载软件里把PD7设置为普通IO
 * minichlink或者官方的wchlinkutility都可以做到。
 *
 * PC4为升压电路监测脚，是ADC的channel2.
 */
static void GPIO_init( void )
{
    RCC->APB2PCENR |= RCC_APB2Periph_GPIOA |
                      RCC_APB2Periph_GPIOD |
                      RCC_APB2Periph_GPIOC; //开启GPIOA，C和D时钟

    //PA2设置为推挽输出
    GPIOA->CFGLR &= ~(0xf<<(4*2));
    GPIOA->CFGLR |= (GPIO_Speed_30MHz | GPIO_CNF_OUT_PP)<<(4*2);

    //PA1设置为复用型推挽输出。
    GPIOA->CFGLR &= ~(0xf<<(4*1));
    GPIOA->CFGLR |= (GPIO_Speed_30MHz | GPIO_CNF_OUT_PP_AF)<<(4*1);

    //PD7设置为复用性推挽输出。
    GPIOD->CFGLR &= ~(0xf<<(4*7));
    GPIOD->CFGLR |= (GPIO_Speed_30MHz | GPIO_CNF_OUT_PP_AF)<<(4*7);

    //PC4设置为模拟输入。
    GPIOC->CFGLR &= ~(0xf<<(4*4));
}

/*初始化ADC。
 * 试过很多种方式，但注入通道确实得和普通通道一起
 * 开启才能有效监控电源电压
 * 希望在频率降到原来三分之一之后可以变得宽松些。
 */
static void ADC_init( void )
{

    RCC->APB2PCENR |= RCC_APB2Periph_ADC1;//开启ADC时钟并初始化所有寄存器
    RCC->APB2PRSTR |= RCC_APB2Periph_ADC1;
    RCC->APB2PRSTR &= ~RCC_APB2Periph_ADC1;

    //设置ADC时钟分频
    RCC->CFGR0 &= ~RCC_ADCPRE;
    RCC->CFGR0 |= RCC_ADCPRE_DIV2;	// 如果5V供电能开到24Mhz

    ADC1->RSQR1 = 0;
    ADC1->RSQR3 = 2UL;//只开一个通道，转换pc4，也就是A2。

    ADC1->ISQR = 8UL<<15;//注入通道转换通道8，即Vref。

    ADC1->SAMPTR2=3<<(3*2)|3<<(3*8);
    //设置采样源的采样时间，并非规则组内通道的时间。

    ADC1->CTLR1 |= ADC_JEOCIE | ADC_SCAN | ADC_JAUTO;//开启转换结束中断

    ADC1->CTLR2 |= ADC_EXTTRIG |ADC_EXTSEL_0|ADC_EXTSEL_1;
    //开启TRGO触发转换功能，开启注入通道软件使能

    ADC1->CTLR2 |= ADC_ADON;

    //校准ADC
    ADC1->CTLR2 |= ADC_RSTCAL;
    while(ADC1->CTLR2 & ADC_RSTCAL);
    ADC1->CTLR2 |= ADC_CAL;
    while(ADC1->CTLR2 & ADC_CAL);

    //先不开启中断，这样就不会操作TIM2导致boost启动。
    //NVIC_EnableIRQ( ADC_IRQn );

}

/*
 * 初始化DMA
 * DMA用于产生有一定相移的pwm信号。注意搬运过程有延时，为了防止故障
 * 考虑额外加一个channel将GPIO在结束时拉低。
 *
 * T1CH4 -> channel 4 -> PA2 BCR
 * T1CH3 -> channel 6 -> PA2 BSHR
 */
static void DMA_init( void )
{
    static uint32_t gpio2 = 1<<2;

    RCC->AHBPCENR |= RCC_AHBPeriph_DMA1;//开启DMA时钟

    //TIM1-CH4和T1CH3分别在DMA4和6通道的，CH3拉高，CH4拉低好了。
    //配置channel2，32位到32位，从存储器搬到外设，单次操作，无中断，
    //最高优先级，开启循环模式。要开循环模式，不开的话搬一次之后数
    //据数量和地址都清零了就没法继续触发了。
    DMA1_Channel4->CFGR |= DMA_CFGR2_EN |
    DMA_Priority_VeryHigh | DMA_MemoryDataSize_Word |
    DMA_PeripheralDataSize_Word | DMA_DIR_PeripheralDST | DMA_Mode_Circular;

    DMA1_Channel4->CNTR = 0x0001;//数据传输数量，就一个。
    DMA1_Channel4->PADDR = (uint32_t)&(GPIOA->BCR);
    //存储器和外设的地址，外设是GPIO的清零寄存器。
    DMA1_Channel4->MADDR = (uint32_t)&gpio2;

    //TIM1-CH3是连接到DMA6通道的，产生DMA请求时通过DMA将PA2拉高。
    DMA1_Channel6->CFGR |= DMA_CFGR2_EN | DMA_Priority_VeryHigh |
    DMA_MemoryDataSize_Word | DMA_PeripheralDataSize_Word |
    DMA_DIR_PeripheralDST | DMA_Mode_Circular;

    DMA1_Channel6->CNTR = 0x0001;//数据传输数量，就一个。
    DMA1_Channel6->PADDR = (uint32_t)&(GPIOA->BSHR);
    //存储器和外设的地址，外设是GPIO的置位寄存器。
    //由于进行了搬运，会使得GPIOA其他所有GPIO都不能再被作为通用IO利用。
    DMA1_Channel6->MADDR = (uint32_t)&gpio2;

}

/* 初始化timer2
 *
 */
static void TIM2_init( void )
{
    RCC->APB1PCENR |= RCC_APB1Periph_TIM2; //开启tim2时钟

    RCC->APB1PRSTR |= RCC_APB1Periph_TIM2; //重置timer2
    RCC->APB1PRSTR &= ~RCC_APB1Periph_TIM2;

    TIM2->CTLR1 |= TIM_ARPE;//开启预装载
    TIM2->CCER |= TIM_CC4E;//使能channel4输出
    TIM2->CHCTLR2 |= ( TIM_OC4M_2 | TIM_OC4M_1 );
    //PWM模式1。
    TIM2->SMCFGR = TIM_SMS_2|TIM_SMS_1;
    //由TRGI，也就是TIM1的触发信号启动定时器
    //TS = 000，输入触发连接到ITR0

    TIM2->CTLR2 |= TIM_MMS_1;
    //更新事件被输出到TRGO，用于触发ADC。这意味着每次计时器溢出就会触发ADC。
    //数据手册中的描述可能有误，产生的是输出而不是输入。

    TIM2->PSC = 0x0000;//不分频，48Mhz为tim2时钟
    TIM2->ATRLR = (uint32_t)288;//周期为160次计数，因此为300khz输出。

    TIM2->CH4CVR = (uint32_t)40;//开始占空比为0

    TIM2->BDTR |= TIM_MOE;


}

/* 初始化timer1
 * CH4和CH3发DMA
 * CH2直接控制引脚
 * CH1给TIM2发TRGO信号。
 *
 */
static void TIM1_init( void )
{
    RCC->APB2PCENR |= RCC_APB2Periph_TIM1; //开启TIM1时钟

    RCC->APB2PRSTR |= RCC_APB2Periph_TIM1; //重置timer1
    RCC->APB2PRSTR &= ~RCC_APB2Periph_TIM1;

    TIM1->CTLR1 |= TIM_ARPE;
    TIM1->CTLR2 |= TIM_MMS_2;
    //Channel1作为触发输出（TRGO）
    TIM1->DMAINTENR |= TIM_TDE | TIM_CC4DE | TIM_CC3DE;//开启CH4和CH3的DMA

    TIM1->PSC = 0x0001 - 1;//不分频，跑在48Mhz
    TIM1->ATRLR = 288UL;
    //288就是跑在166khz，交错三倍频对于flyback就是500khz。

    TIM1->CHCTLR1 |=    TIM_OC1M |
                      ( TIM_OC2M_2 | TIM_OC2M_1 ) |
                        TIM_OC1PE | TIM_OC2PE;
    TIM1->CHCTLR2 |=  ( TIM_OC3M_2 | TIM_OC3M_1 ) |
                      ( TIM_OC4M_2 | TIM_OC4M_1 ) |
                        TIM_OC3PE | TIM_OC4PE;
    //四个通道除了CH1均为PWM模式1，在达到计数值前为有效电平,均开启预装载，
    //配置为输出。CH1因为是发TRGO信号的，所以是到计数值才为
    //有效电平。

    TIM1->CCER |= TIM_CC2E;//开启通道2输出到引脚

    TIM1->CH1CVR = 96+40+15UL; //让TIM2在三分之一相移之后启动
    TIM1->CH2CVR = 40;    //这里是直出
    TIM1->CH3CVR = 190UL; //CH3是拉高，起点在三分之二，相当于240相移
    TIM1->CH4CVR = 190+1UL; //CH4是拉低

    TIM1->SWEVGR |= TIM_UG;//产生更新事件

    TIM1->BDTR = TIM_MOE;//使能输出。

    //这里还不能启动TIM1，TIM2配置完成后再启动。
}

/**
 * @brief 软启动升压电路。在初始化 ADC 和 HV 驱动器之后需要使用这个函数启动升压电路。
 *
 * 该函数固定占空比2.5%，确保输出电压逐渐上升到足够的水平。
 * 启动过程中会禁用 ADC 中断，所以不是PID。
 *
 * @note 这一步的目标电压是固定的15V，可调节while的条件以更改。
 *
 */
static void Soft_Start()
{
    //软启动过程，以低占空比启动直到输出电压足够。
    TIM1->CTLR1 |= TIM_CEN;
    TIM1->CH2CVR = 0;
    NVIC_DisableIRQ( ADC_IRQn );
    TIM1->CH2CVR = 5;
    while(ADC1->RDATAR < 30);
    NVIC_EnableIRQ( ADC_IRQn );
}

/**
 *
 * @brief 关掉H桥和升压，停止输出。
 *
 *
 * @note PD2是DMA控制的，光是关掉计数器还不够。
 */

static void Cease_Output()
{
    TIM2->CTLR1 &= ~TIM_CEN;
    TIM1->CTLR1 &= ~TIM_CEN;
    TIM2->CH4CVR = 0;
    GPIOD->BCR = 1<<7;//PD7需要手动关掉以防万一。
    NVIC_DisableIRQ( ADC_IRQn );

}


int main( void )
{
    SystemInit(); //初始化系统时钟。
    //ch32fun的sdk默认跑在HSI-PLL-48mhz,外设不分频。
    GPIO_init(); //初始化外设
    ADC_init(); //初始化ADC
    DMA_init(); //初始化DMA操作器，全桥控制需要用它来控制另一对桥臂以实现相移
    TIM2_init();
    TIM1_init(); //初始化升压电路驱动
    Soft_Start();


    for(;;)
    {
        Delay_Ms(2000);
     // Cease_Output();
        Delay_Ms(2000);
    }

}

//ADC的中断处理函数


void ADC1_IRQHandler(void)
{
    ADC1->STATR = 0;//清空标志位
    adcval =  ( adcval >> 1 ) + ((ADC1->RDATAR) >> 1);
    vccval =  ( vccval >> 1 ) + ((ADC1->IDATAR4)>> 1);
    //读取ADC值，这里是一半旧值加一半新值，滤波

    int32_t setpoint_vdd = (385*vccval)>>8; //这里才是真的设定值。
    /*PI控制器部分。*/

    int32_t error = setpoint_vdd-adcval;//计算误差
    int32_t CO = 0;//控制输出。
    static int32_t intergal;//积分项
    static int32_t preverror;//上一次的误差

    intergal += (error>>2); //积分系数为0.25

    //控制积分上下限
    intergal = intergal > 160 ? 160 : intergal;
    intergal = intergal < -20 ? -20 :intergal;

    CO = (error<<2) + intergal + ( (error-preverror)<<1 );
    //比例系数为4,微分系数为2

    //限制CO上下限。
    CO = CO >= 128 ? 128 : CO;
    CO = CO <= 0 ? 0 : CO;

    //测试用，每个都是一半输出。
    TIM1->CH2CVR = 40UL;


    preverror = error;

}
